// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7;
// a = 2; b = 10 -> max = 10;
// a = -9; b = -3 -> max = -3;

// Console.WriteLine("программа вычисления min и max числа");
// Console.WriteLine("Введите 2 числа");

// int input1 = int.Parse(Console.ReadLine()!);
// int input2 = int.Parse(Console.ReadLine()!);
//    if (input1>input2)
//    {
//        Console.WriteLine("максимальное число-" + input1); 
//        Console.WriteLine("минимальное число-" + input2);
//    }
//     if (input1<input2)
//     {
//        Console.WriteLine("максимальное число-" + input2);
//        Console.WriteLine("минимальное число-" + input1);
//     }
